import { SiteConfig } from "@/types"

import { env } from "@/env.mjs"

export const siteConfig: SiteConfig = {
  name: "Зэн Нөтбүүк Дэлгүүр",
  author: "зэнлаптоп",
  description:
    "Зэн Лаптоп Дэлгүүр - Хамгийн сүүлийн үеийн, шилдэг лаптопуудыг нэг дороос.",
  keywords: ["Цахим худалдаа", "Лаптопууд", "Технологи", "Онлайн дэлгүүр"],
  url: {
    base: env.NEXT_PUBLIC_APP_URL,
    author: "https://zenshop.enk.icu",
  },
  links: {
    github: "https://github.com/enkhbold470",
  },
  ogImage: `${env.NEXT_PUBLIC_APP_URL}/og.jpg`,
  about:
    "Зэн Лаптоп Дэлгүүр нь хамгийн сүүлийн үеийн, шилдэг лаптопуудыг санал болгодог онлайн дэлгүүр юм. Бидний зорилго бол хэрэглэгчдэдээ хамгийн чанартай, найдвартай бүтээгдэхүүнийг хүргэх явдал юм.",
  goal: "Бидний зорилго бол үйлчлүүлэгчдийн хэрэгцээг ойлгож, тэдэнд хамгийн тохирсон лаптопуудыг санал болгох, улмаар Монголын хэрэглэгчдэд технологийн дэвшлийг хүртээмжтэй болгох явдал юм.",
}
